## Aufgabenstellung

Analysieren der Datei books.csv

* Schritt 1: Laden der Datei
* Schritt 2: Prepare der Daten in einen DataFrame

In [ ]:
import numpy as np 
import pandas as pd

In [ ]:
books_data_frame = pd.read_csv('books.csv')
books_data_frame.rename(columns={'ISBN': 'isbn', 'Title': 'title', 'Price': 'books_price'})

* Play with references

In [ ]:
books_data_frame = pd.read_csv('books.csv')
df2 = books_data_frame.copy()
books_data_frame.rename(columns={'ISBN': 'isbn', 'Title': 'title', 'Price': 'books_price'}, inplace=True)
df2

## Selektion

### loc und iloc

* loc: Selektion über einen Index-Wert
* iloc: Selektion über den technischen Index

In [21]:
df = pd.read_csv('books.csv', index_col='ISBN')
df
#df.loc[3:6, ['Title', 'ISBN']]
df.loc['ISBN-3']
df.iloc[3:6]

          Title  Price
ISBN
ISBN-4  Title 4     91
ISBN-5  Title 5     41
ISBN-6  Title 6     62

### Selektion mit Kriterien

In [37]:
# Demonstration: erzeugen eines Boolean-Arrays
selection = [False]*df.index.size

selection[9] = True
selection[66] = True

selection

# Real, untypisch

selection = df['Price'] > 80 # Ergebnis ist ein Boolean-Array mit Treffer = True
#selected_data_frame = df[selection] # neuer DataFrame, der nur aus den Treffern besteht
#selected_data_frame['Price']
df[selection]

selection = (df['Price'] > 80) & (df['Price'] < 91)
df[selection]

selection = (df['Price'] > 80) & (df['ISBN'].str.endswith('3'))
df[selection]

# Real, typisch
#df[df['Price'] > 90]

       ISBN                      Title  Price
12  ISBN-13                   Title 13     87
62  ISBN-63  Data Analysis with Python     87
84  ISBN-83                   Title 85     84

* Typisierung im DataFrame

In [23]:
df.head(3)
df.dtypes

Title    object
Price     int64
dtype: object

* Find Duplicates

In [29]:
df = pd.read_csv('books.csv')
df[df.duplicated('ISBN', False)]

       ISBN     Title  Price
1    ISBN-2   Title 2     15
41  ISBN-42  Title 42     79
68   ISBN-2  Title 69     75
75  ISBN-42  Title 76     92
89  ISBN-42  Title 90     67